<?php
session_start();

// ----------------------------------------------------------------
//まず前のphpからデーターを受け取る（この受け取ったデータをもとにbindValueと結びつけるため）
// ----------------------------------------------------------------
$lid = $_POST["lid"];
$lpw = $_POST["lpw"];


// ----------------------------------------------------------------
//1.DB接続します xxxにDB名を入力する
// ----------------------------------------------------------------
try {
    $pdo = new PDO('mysql:dbname=gs_kadai_08;charset=utf8;host=localhost', 'root', '');
} catch (PDOException $e) {
    exit('DbConnectError:'.$e->getMessage());
}

// ----------------------------------------------------------------
//2. データ登録SQL作成
// ----------------------------------------------------------------
$stmt = $pdo->prepare("SELECT * FROM user_table WHERE lid=:lid AND lpw=:lpw");
$stmt->bindValue(':lid', $lid); //php変数に置き換えてもOK
$stmt->bindValue(':lpw', $lpw);
$res = $stmt->execute();

// ----------------------------------------------------------------
//3．データ登録処理後
// ----------------------------------------------------------------
if ($res==false) {
    //SQL実行時にエラーがある場合（エラーオブジェクト取得して表示）
    $error = $stmt->errorInfo();
    exit("QueryError:".$error[2]);
}

// ----------------------------------------------------------------
//抽出データ数を取得
// ----------------------------------------------------------------
$val = $stmt->fetch(); //1レコードだけを取得する

// ----------------------------------------------------------------
//5. 該当レコードがあればSESSIONに値を代入 ※空っぽじゃなければ（認証がオッケーだったときに新しくセッションIDを作る）
// ----------------------------------------------------------------
if ($val["id"] != "") {
    $_SESSION["chk_ssid"]  = session_id();//ここでログインしているか判断するsessionID
    $_SESSION["user_id"] = $val['id'];//DBに格納されたidという引き出しに入っているデータ
    header("Location:../top.php");
} else {
    //login処理を経由して全画面へ
    header("Location:../login.php");
}
exit();

